Integrate the SVG Scanner into the existing state machine.
This ensures SVG scanning is now part of the normal virus scanning
workflow. Only SVG files are scanned. The state machine can only call
public methods, so schedule_svg_scan is public, unlike
schedule_virus_scan, which isn't called by the state machine.

Have included the necessary amount of model testing to ensure the state
machine works, and added in a request level test for an SVG asset.
