--- a/docs/asset_state_machine_overview.md
+++ b/docs/asset_state_machine_overview.md
@@ -15,45 +15,26 @@ Assets must be in draft for certain authorisation protocols to apply. See [docum
 
 NB: There are some invalid remnants of a previous state machine, including state values such as `deleted`, in the database. These should be removed.
 
-```
-┌──────────────┐
-│  Unscanned   │
-│  (Initial)   │
-└──────┬───────┘
-       │
-       ▼
-[VirusScanJob triggered]
-       │
-       ▼
-[Virus scan performed]
-           │
-   ┌───────┴────────┐
-   │                │
-   ▼                ▼
-(scanned_clean)   (scanned_infected)
-   │                │
-   ▼                ▼
-┌──────────┐    ┌────────────┐
-│  Clean   │    │  Infected  │
-└────┬─────┘    └────────────┘
-     │
-     ▼
-[SaveToCloudStorageJob triggered]
-     │
-     ▼
-[Asset uploaded to AWS S3 bucket]
-     │
-     ▼
-(upload_success)
-     │
-     ▼
-┌──────────┐
-│ Uploaded │
-└──────────┘
+```mermaid
+flowchart TD
+    Unscanned("Unscanned\n(Initial)") --> TriggerVirusScan["VirusScanJob triggered"]
+    TriggerVirusScan --> VirusScanPerformed["Virus scan performed"]
+
+    VirusScanPerformed -->|virus_scanned_clean| VirusScannedClean("Virus Scanned Clean")
+    VirusScanPerformed -->|scanned_infected| Infected("Infected")
+
+    VirusScannedClean --> TriggerSvgScan["SvgScanJob triggered"]
+    TriggerSvgScan --> SvgScanPerformed["SVG scan performed"]
+
+    SvgScanPerformed -->|svg_scanned_clean| Clean("Clean")
+    SvgScanPerformed -->|scanned_infected| Infected("Infected")
+
+    Clean --> TriggerSaveToCloudStorageJob["SaveToCloudStorageJob triggered"]
+    TriggerSaveToCloudStorageJob --> Upload["Asset uploaded to AWS S3 bucket"]
+    Upload -->|upload_success| Uploaded("Uploaded")
 ```
 
 3. `deleted_at`
